app/Controllers/MateriasController.php

SELECT *
FROM `materias`
ORDER BY `nombre_materia` ASC
---
    public function mostrar_materias()
    {
        $db = \Config\Database::connect();

        $query = $db->table('materias')
        //->where('cuatrimestre', 1)
        //->where('id_materia <', 5)
        ->orderBy('nombre_materia', 'asc')
        ->get();
        $resultado = $query->getResultArray();// SI PONGO getResult() ME VA A DEVOLVER EL RESULTADO EN OBJETOS

SELECT *
FROM `carreras`
---
    public function insertar_materia1()
    {

        $db = \Config\Database::connect();


            $sql = $db->table('carreras');
            //$sql->select('id_carrera,nombre_carrera');
            $query = $sql->get();

INSERT INTO `materias` (`nombre_materia`, `cuatrimestre`, `id_carrera_materia`) VALUES ('ambiente empresarial', '', '1')
---
    public function insertar_materia2()
    {

        $n = ($_POST['nombre']);
        $c = ($_POST['cuatrimestre']);
        $cc = ($_POST['id_carrera']);
        //echo $var;

        $arreglo = [

            'nombre_materia'=> $n,
            'cuatrimestre'=> $c,
            'id_carrera_materia'=> $cc
        ];

        //echo $this->materiaModel->insert($arreglo); // DEVUELVE EL ID DEL REGISTRO INGRESADO
        echo $this->materiaModel->insert($arreglo ,false); //SI LO PONGO ASÍ ME DEVUELVE 1 SI INSERTO Y 0 SINO