app/Controllers/NuevoController.php

SELECT *
FROM `titulos`
SELECT *
FROM `materias`
---
    public function cargar_datos()
    {
        // Cargar datos existentes en caso de que ya haya información en la sesión
        $data4 = [
            'datos_titulos' => session()->get('datos_paso1') ?? [],
            'datos_otros_titulos' => session()->get('datos_otros_titulos') ?? [],
            'datos_postgrado' => session()->get('datos_postgrado') ?? [],
            'datos_antiguedad' => session()->get('datos_antiguedad') ?? [],
            'datos_fr' => session()->get('datos_fr') ?? [],
            'datos_fo' => session()->get('datos_fo') ?? [],
            'datos_i' => session()->get('datos_i') ?? [],
            'datos_oa' => session()->get('datos_oa') ?? [],
            'datos_al' => session()->get('datos_al') ?? [],

        ];

        $db = \Config\Database::connect();


        $sql = $db->table('titulos');
        //$sql->select('id_carrera,nombre_carrera');
        $query = $sql->get();
        $resultado = $query->getResultArray();

        $data = ['titulo'=> 'Listado de Títulos', 'titulos'=>$resultado];
        //return view('mostrarValidaciones', $data);

        $sql2 = $db->table('materias');
        //$sql->select('id_carrera,nombre_carrera');
        $query2 = $sql2->get();

SELECT *
FROM `condicion_docente`
---

        $sql3 = $db->table('condicion_docente');
        //$sql->select('id_carrera,nombre_carrera');
        $query3 = $sql3->get();

SELECT *
FROM `otros_titulos`
WHERE `otros_titulos`.`id_otros_titulos` = '1'
---
             $otros_t = new OtrosTitulosModel();
             // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
             foreach ($datosTabla9 as $t) {
                 $otros_titulo = $otros_t->find($t['id_otros_titulos']); // Suponiendo que el método find busca por la clave primaria

SELECT *
FROM `otros_titulos`
WHERE `otros_titulos`.`id_otros_titulos` = '1'
---
            $otros_t = new OtrosTitulosModel();
            // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
            foreach ($datosTabla8 as $t) {
            $otros_titulo = $otros_t->find($t['id_otros_titulos']); // Suponiendo que el método find busca por la clave primaria