app/Controllers/PersonController.php


        $ca = new DetalleCapacitacionModel();
        foreach ($datosTabla3 as $c) {
            $capacitacion = $ca->find($c['id_detalle_capacitacion']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_capacitacion`
WHERE `detalle_capacitacion`.`id_detalle_capacitacion` = '2'


        $dl = new DetalleAntLabModel();
        foreach ($datosTabla4 as $de) {
            $detalle_la = $dl->find($de['id_detalle_lab']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_lab`
WHERE `detalle_ant_lab`.`id_detalle_lab` = '1'


        $do = new DetalleAntDocModel();
        foreach ($datosTabla5 as $dc) {
            $detalle_do = $do->find($dc['id_detalle_doc']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_doc`
WHERE `detalle_ant_doc`.`id_detalle_doc` = '2'