app/Controllers/PersonController.php

    public function paso1()
    {
        $db = \Config\Database::connect();


        $sql = $db->table('titulos');
        //$sql->select('id_carrera,nombre_carrera');
        $query = $sql->get();
        $resultado = $query->getResultArray();

        $data = ['titulo'=> 'Listado de Títulos', 'titulos'=>$resultado];
        //return view('mostrarValidaciones', $data);

        $sql2 = $db->table('materias');
        //$sql->select('id_carrera,nombre_carrera');
        $query2 = $sql2->get();
        $resultado2 = $query2->getResultArray();

        $data2 = ['titulo'=> 'Listado de Materias', 'materias'=>$resultado2];
        //return view('mostrarValidaciones', $data);

        $sql3 = $db->table('condicion_docente');
        //$sql->select('id_carrera,nombre_carrera');
        $query3 = $sql3->get();
---
SELECT *
FROM `titulos`
SELECT *
FROM `materias`
SELECT *
FROM `condicion_docente`

        $otros_t = new OtrosTitulosModel();
        // Recorrer el array de códigos y obtener los puntajes del modelo TitulosPostgradoModel
        foreach ($datosTabla8 as $t) {
            $otros_titulo = $otros_t->find($t['id_otros_titulos']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `otros_titulos`
WHERE `otros_titulos`.`id_otros_titulos` = '1'


        $ca = new DetalleCapacitacionModel();
        foreach ($datosTabla3 as $c) {
            $capacitacion = $ca->find($c['id_detalle_capacitacion']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_capacitacion`
WHERE `detalle_capacitacion`.`id_detalle_capacitacion` = '2'


        $dl = new DetalleAntLabModel();
        foreach ($datosTabla4 as $de) {
            $detalle_la = $dl->find($de['id_detalle_lab']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_lab`
WHERE `detalle_ant_lab`.`id_detalle_lab` = '2'


        $do = new DetalleAntDocModel();
        foreach ($datosTabla5 as $dc) {
            $detalle_do = $do->find($dc['id_detalle_doc']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_doc`
WHERE `detalle_ant_doc`.`id_detalle_doc` = '2'

    public function Mostrar_Valoraciones_Por_Materia()
    {
        $db = \Config\Database::connect();


        $sql2 = $db->table('materias');
        //$sql->select('id_carrera,nombre_carrera');
        $query2 = $sql2->get();
---
SELECT *
FROM `materias`

        $datos_capacitacion = $cap->getCodigoById_detallae_cap($id_va);
        $ca = new DetalleCapacitacionModel();
        foreach ($datos_capacitacion as $c) {
            $capacitacion = $ca->find($c['id_detalle_capacitacion']);
---
SELECT *
FROM `detalle_capacitacion`
WHERE `detalle_capacitacion`.`id_detalle_capacitacion` = '1'

        $datosTabla4 = $antLab->getDatosById_detalle_lab($id_va);//ACÁ PUEDE TRAER
        $dl = new DetalleAntLabModel();
        foreach ($datosTabla4 as $de) {
           $detalle_la = $dl->find($de['id_detalle_lab']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_lab`
WHERE `detalle_ant_lab`.`id_detalle_lab` = '1'

        $datosTabla5 = $antDoc->getDatosById_ant_doc($id_va);//ACÁ PUEDE TRAER VARIOS
        $do = new DetalleAntDocModel();
        foreach ($datosTabla5 as $dc) {
           $detalle_do = $do->find($dc['id_detalle_doc']); // Suponiendo que el método find busca por la clave primaria
---
SELECT *
FROM `detalle_ant_doc`
WHERE `detalle_ant_doc`.`id_detalle_doc` = '2'