app/Controllers/PlanesController.php

    public function mostrarPlanes()
    {

        $db = \Config\Database::connect();


            $sql = $db->table('carreras');
            //$sql->select('id_carrera,nombre_carrera');
            $query = $sql->get();
---
SELECT *
FROM `carreras`