app/Controllers/Validacion.php

SELECT *
FROM `materias`
ORDER BY `nombre_materia` ASC
---
    public function mostrar_validaciones()
    {

       /*
        $cc = new ValidacionModel();
        $re = $cc->find($dni);
        $data2 = ['titulo'=> 'Mostrar validaciones por DNI', 'validaciones'=> $re];

        return view('mostrarValidaciones.php', $data2);
        */

        {
            $db = \Config\Database::connect();

            $var = ($_POST['codigo']);
            //echo $var;

            $sql = $db->table('valoracion v');
            $sql->select('v.*, m.nombre_materia');
            $sql->join('materias m', 'v.id_materia_valoracion = m.id_materia')->where('dni', $var);
            $query = $sql->get();

SELECT `v`.*, `m`.`nombre_materia`
FROM `valoracion` `v`
JOIN `materias` `m` ON `v`.`id_materia_valoracion` = `m`.`id_materia`
SELECT `c`.`detalle_condicion`
FROM `valoracion` `v`
JOIN `condicion_docente` `c` ON `v`.`id_condicion` = `c`.`id_condicion`
SELECT `t`.`detalle_titulo`
FROM `valoracion` `v`
JOIN `titulos` `t` ON `v`.`id_titulo` = `t`.`id_titulo`
---
    public function mostrar_valoraciones()
    {
        {
            $db = \Config\Database::connect();



            $sql = $db->table('valoracion v');
            $sql->select('v.*, m.nombre_materia');
            $sql->join('materias m', 'v.id_materia_valoracion = m.id_materia');
            $query = $sql->get();
            $resultado = $query->getResultArray();

            $sql2 = $db->table('valoracion v');
            $sql2->select('c.detalle_condicion');
            $sql2->join('condicion_docente c', 'v.id_condicion = c.id_condicion');
            $query2 = $sql2->get();
            $resultado2 = $query2->getResultArray();

            $sql3 = $db->table('valoracion v');
            $sql3->select('t.detalle_titulo');
            $sql3->join('titulos t', 'v.id_titulo = t.id_titulo');
            $query3 = $sql3->get();

SELECT `m`.*
FROM `materias` `m`
WHERE `id_carrera_materia` = '1'
---
    public function mostrarPlanes3()
    {


        {
            $db = \Config\Database::connect();

            $var = ($_POST['id_carrera']);
            //echo $var;

            $sql = $db->table('materias m');
            $sql->select('m.*');
            $sql->where('id_carrera_materia', $var);
            $query = $sql->get();