app/Models/DocenteModel.php

    public function getDocente($id_docente)
    {
        return $this->find($id_docente);
---
SELECT *
FROM `docente`
WHERE `docente`.`id` = '1'

    public function getDocentes()
    {
        return $this->findAll();
---
SELECT *
FROM `docente`

    public function getDatosDocentes($dni)
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->where('dni', $dni);
        $query = $builder->get();
---
SELECT *
FROM `docente`
WHERE `dni` = '23'