app/Models/ValidacionModel.php

   public function getCodigoByDni($dni)
   {
       $builder = $this->db->table($this->table);
       $builder->select('id_valoracion');
       $builder->where('dni',$dni);
       $query = $builder->get();
---
SELECT `id_valoracion`
FROM `valoracion`
WHERE `dni` = '20130177'

   public function getValidacionesPorMateria($dato)
   {
       $builder = $this->db->table($this->table);
       $builder->select('*');
       $builder->where('id_materia_valoracion',$dato);
       $query = $builder->get();
---
SELECT *
FROM `valoracion`
WHERE `id_materia_valoracion` = ('34')